app/Controllers/Pages.php

    public function index()
    {
        // Start Card find
        // $db = \Config\Database::connect();
        // $card = $db->query("SELECT * FROM card ORDER BY id DESC");
        $card = $this->cardsModel->findAll(); //('SELECT' ANOTHER WAY)
        $pagination = $this->cardsModel->orderBy('id', 'DESC')->paginate(6, 'card');
---
SELECT *
FROM `card`
SELECT *
FROM `card`
ORDER BY `id` DESC
 LIMIT 6
SELECT COUNT(*) AS `numrows`
FROM `card`