app/Controllers/ShowDoc.php

    public function detailDoc($id){
        $doc = $this->docModel->where(['id' => $id])->first();
---
SELECT *
FROM `doc`
WHERE `id` = '15'
 LIMIT 1